Tests/Vsphere/vsphere_performance.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16KiB each
2MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      5092.51
    writes/s:                     3395.01
    fsyncs/s:                     10912.40

Throughput:
    read, MiB/s:                  79.57
    written, MiB/s:               53.05

General statistics:
    total time:                          10.0208s
    total number of events:              194001

Latency (ms):
         min:                                    0.00
         avg:                                    0.21
         max:                                  181.26
         95th percentile:                        0.97
         sum:                                39806.30

Threads fairness:
    events (avg/stddev):           48500.2500/1135.73
    execution time (avg/stddev):   9.9516/0.01